
function set𝝭!(::Element{:Hex8},x::Node)
    ξ = x.ξ
    η = x.η
    ζ = x.γ
    𝝭 = x[:𝝭]
    𝝭[1] = 0.125*(1.0-ξ)*(1.0-η)*(1.0-ζ)
    𝝭[2] = 0.125*(1.0+ξ)*(1.0-η)*(1.0-ζ)
    𝝭[3] = 0.125*(1.0+ξ)*(1.0+η)*(1.0-ζ)
    𝝭[4] = 0.125*(1.0-ξ)*(1.0+η)*(1.0-ζ)
    𝝭[5] = 0.125*(1.0-ξ)*(1.0-η)*(1.0+ζ)
    𝝭[6] = 0.125*(1.0+ξ)*(1.0-η)*(1.0+ζ)
    𝝭[7] = 0.125*(1.0+ξ)*(1.0+η)*(1.0+ζ)
    𝝭[8] = 0.125*(1.0-ξ)*(1.0+η)*(1.0+ζ)
end

function set∇𝝭!(ap::Element{:Hex8},x::Node)
    ξ = x.ξ
    η = x.η
    ζ = x.γ
    𝓒 = ap.𝓒
    𝝭 = x[:𝝭]
    𝝭[1] = 0.125*(1.0-ξ)*(1.0-η)*(1.0-ζ)
    𝝭[2] = 0.125*(1.0+ξ)*(1.0-η)*(1.0-ζ)
    𝝭[3] = 0.125*(1.0+ξ)*(1.0+η)*(1.0-ζ)
    𝝭[4] = 0.125*(1.0-ξ)*(1.0+η)*(1.0-ζ)
    𝝭[5] = 0.125*(1.0-ξ)*(1.0-η)*(1.0+ζ)
    𝝭[6] = 0.125*(1.0+ξ)*(1.0-η)*(1.0+ζ)
    𝝭[7] = 0.125*(1.0+ξ)*(1.0+η)*(1.0+ζ)
    𝝭[8] = 0.125*(1.0-ξ)*(1.0+η)*(1.0+ζ)
    x₁,x₂,x₃,x₄,x₅,x₆,x₇,x₈ = (xᵢ.x for xᵢ in 𝓒)
    y₁,y₂,y₃,y₄,y₅,y₆,y₇,y₈ = (xᵢ.y for xᵢ in 𝓒)
    z₁,z₂,z₃,z₄,z₅,z₆,z₇,z₈ = (xᵢ.z for xᵢ in 𝓒)
    ∂N₁∂ξ,∂N₂∂ξ,∂N₃∂ξ,∂N₄∂ξ,∂N₅∂ξ,∂N₆∂ξ,∂N₇∂ξ,∂N₈∂ξ = get∂𝝭∂ξ(ap,ξ,η,ζ)
    ∂N₁∂η,∂N₂∂η,∂N₃∂η,∂N₄∂η,∂N₅∂η,∂N₆∂η,∂N₇∂η,∂N₈∂η = get∂𝝭∂η(ap,ξ,η,ζ)
    ∂N₁∂ζ,∂N₂∂ζ,∂N₃∂ζ,∂N₄∂ζ,∂N₅∂ζ,∂N₆∂ζ,∂N₇∂ζ,∂N₈∂ζ = get∂𝝭∂ζ(ap,ξ,η,ζ) 
    ∂x∂ξ = ∂N₁∂ξ*x₁ + ∂N₂∂ξ*x₂ + ∂N₃∂ξ*x₃ + ∂N₄∂ξ*x₄ + ∂N₅∂ξ*x₅ + ∂N₆∂ξ*x₆ + ∂N₇∂ξ*x₇ + ∂N₈∂ξ*x₈
    ∂x∂η = ∂N₁∂η*x₁ + ∂N₂∂η*x₂ + ∂N₃∂η*x₃ + ∂N₄∂η*x₄ + ∂N₅∂η*x₅ + ∂N₆∂η*x₆ + ∂N₇∂η*x₇ + ∂N₈∂η*x₈
    ∂x∂ζ = ∂N₁∂ζ*x₁ + ∂N₂∂ζ*x₂ + ∂N₃∂ζ*x₃ + ∂N₄∂ζ*x₄ + ∂N₅∂ζ*x₅ + ∂N₆∂ζ*x₆ + ∂N₇∂ζ*x₇ + ∂N₈∂ζ*x₈
    ∂y∂ξ = ∂N₁∂ξ*y₁ + ∂N₂∂ξ*y₂ + ∂N₃∂ξ*y₃ + ∂N₄∂ξ*y₄ + ∂N₅∂ξ*y₅ + ∂N₆∂ξ*y₆ + ∂N₇∂ξ*y₇ + ∂N₈∂ξ*y₈
    ∂y∂η = ∂N₁∂η*y₁ + ∂N₂∂η*y₂ + ∂N₃∂η*y₃ + ∂N₄∂η*y₄ + ∂N₅∂η*y₅ + ∂N₆∂η*y₆ + ∂N₇∂η*y₇ + ∂N₈∂η*y₈
    ∂y∂ζ = ∂N₁∂ζ*y₁ + ∂N₂∂ζ*y₂ + ∂N₃∂ζ*y₃ + ∂N₄∂ζ*y₄ + ∂N₅∂ζ*y₅ + ∂N₆∂ζ*y₆ + ∂N₇∂ζ*y₇ + ∂N₈∂ζ*y₈
    ∂z∂ξ = ∂N₁∂ξ*z₁ + ∂N₂∂ξ*z₂ + ∂N₃∂ξ*z₃ + ∂N₄∂ξ*z₄ + ∂N₅∂ξ*z₅ + ∂N₆∂ξ*z₆ + ∂N₇∂ξ*z₇ + ∂N₈∂ξ*z₈
    ∂z∂η = ∂N₁∂η*z₁ + ∂N₂∂η*z₂ + ∂N₃∂η*z₃ + ∂N₄∂η*z₄ + ∂N₅∂η*z₅ + ∂N₆∂η*z₆ + ∂N₇∂η*z₇ + ∂N₈∂η*z₈
    ∂z∂ζ = ∂N₁∂ζ*z₁ + ∂N₂∂ζ*z₂ + ∂N₃∂ζ*z₃ + ∂N₄∂ζ*z₄ + ∂N₅∂ζ*z₅ + ∂N₆∂ζ*z₆ + ∂N₇∂ζ*z₇ + ∂N₈∂ζ*z₈
    detJ = ∂x∂ξ*∂y∂η*∂z∂ζ + ∂x∂η*∂y∂ζ*∂z∂ξ + ∂x∂ζ*∂y∂ξ*∂z∂η - ∂x∂ξ*∂y∂ζ*∂z∂η - ∂x∂η*∂y∂ξ*∂z∂ζ - ∂x∂ζ*∂y∂η*∂z∂ξ

    ∂ξ∂x = ( ∂y∂η*∂z∂ζ - ∂y∂ζ*∂z∂η)/detJ
    ∂η∂x = (-∂y∂ξ*∂z∂ζ + ∂y∂ζ*∂z∂ξ)/detJ
    ∂ζ∂x = ( ∂y∂ξ*∂z∂η - ∂y∂η*∂z∂ξ)/detJ

    ∂ξ∂y = (-∂x∂η*∂z∂ζ + ∂x∂ζ*∂z∂η)/detJ
    ∂η∂y = ( ∂x∂ξ*∂z∂ζ - ∂x∂ζ*∂z∂ξ)/detJ
    ∂ζ∂y = (-∂x∂ξ*∂z∂η + ∂x∂η*∂z∂ξ)/detJ

    ∂ξ∂z = ( ∂x∂η*∂y∂ζ - ∂x∂ζ*∂y∂η)/detJ
    ∂η∂z = (-∂x∂ξ*∂y∂ζ + ∂x∂ζ*∂y∂ξ)/detJ
    ∂ζ∂z = ( ∂x∂ξ*∂y∂η - ∂x∂η*∂y∂ξ)/detJ

    ∂𝝭∂x = x[:∂𝝭∂x]
    ∂𝝭∂y = x[:∂𝝭∂y]
    ∂𝝭∂z = x[:∂𝝭∂z]

    ∂𝝭∂x[1] = ∂N₁∂ξ*∂ξ∂x + ∂N₁∂η*∂η∂x + ∂N₁∂ζ*∂ζ∂x
    ∂𝝭∂x[2] = ∂N₂∂ξ*∂ξ∂x + ∂N₂∂η*∂η∂x + ∂N₂∂ζ*∂ζ∂x
    ∂𝝭∂x[3] = ∂N₃∂ξ*∂ξ∂x + ∂N₃∂η*∂η∂x + ∂N₃∂ζ*∂ζ∂x
    ∂𝝭∂x[4] = ∂N₄∂ξ*∂ξ∂x + ∂N₄∂η*∂η∂x + ∂N₄∂ζ*∂ζ∂x
    ∂𝝭∂x[5] = ∂N₅∂ξ*∂ξ∂x + ∂N₅∂η*∂η∂x + ∂N₅∂ζ*∂ζ∂x
    ∂𝝭∂x[6] = ∂N₆∂ξ*∂ξ∂x + ∂N₆∂η*∂η∂x + ∂N₆∂ζ*∂ζ∂x
    ∂𝝭∂x[7] = ∂N₇∂ξ*∂ξ∂x + ∂N₇∂η*∂η∂x + ∂N₇∂ζ*∂ζ∂x
    ∂𝝭∂x[8] = ∂N₈∂ξ*∂ξ∂x + ∂N₈∂η*∂η∂x + ∂N₈∂ζ*∂ζ∂x
    
    ∂𝝭∂y[1] = ∂N₁∂ξ*∂ξ∂y + ∂N₁∂η*∂η∂y + ∂N₁∂ζ*∂ζ∂y
    ∂𝝭∂y[2] = ∂N₂∂ξ*∂ξ∂y + ∂N₂∂η*∂η∂y + ∂N₂∂ζ*∂ζ∂y
    ∂𝝭∂y[3] = ∂N₃∂ξ*∂ξ∂y + ∂N₃∂η*∂η∂y + ∂N₃∂ζ*∂ζ∂y
    ∂𝝭∂y[4] = ∂N₄∂ξ*∂ξ∂y + ∂N₄∂η*∂η∂y + ∂N₄∂ζ*∂ζ∂y
    ∂𝝭∂y[5] = ∂N₅∂ξ*∂ξ∂y + ∂N₅∂η*∂η∂y + ∂N₅∂ζ*∂ζ∂y
    ∂𝝭∂y[6] = ∂N₆∂ξ*∂ξ∂y + ∂N₆∂η*∂η∂y + ∂N₆∂ζ*∂ζ∂y
    ∂𝝭∂y[7] = ∂N₇∂ξ*∂ξ∂y + ∂N₇∂η*∂η∂y + ∂N₇∂ζ*∂ζ∂y
    ∂𝝭∂y[8] = ∂N₈∂ξ*∂ξ∂y + ∂N₈∂η*∂η∂y + ∂N₈∂ζ*∂ζ∂y

    ∂𝝭∂z[1] = ∂N₁∂ξ*∂ξ∂z + ∂N₁∂η*∂η∂z + ∂N₁∂ζ*∂ζ∂z
    ∂𝝭∂z[2] = ∂N₂∂ξ*∂ξ∂z + ∂N₂∂η*∂η∂z + ∂N₂∂ζ*∂ζ∂z
    ∂𝝭∂z[3] = ∂N₃∂ξ*∂ξ∂z + ∂N₃∂η*∂η∂z + ∂N₃∂ζ*∂ζ∂z
    ∂𝝭∂z[4] = ∂N₄∂ξ*∂ξ∂z + ∂N₄∂η*∂η∂z + ∂N₄∂ζ*∂ζ∂z
    ∂𝝭∂z[5] = ∂N₅∂ξ*∂ξ∂z + ∂N₅∂η*∂η∂z + ∂N₅∂ζ*∂ζ∂z
    ∂𝝭∂z[6] = ∂N₆∂ξ*∂ξ∂z + ∂N₆∂η*∂η∂z + ∂N₆∂ζ*∂ζ∂z
    ∂𝝭∂z[7] = ∂N₇∂ξ*∂ξ∂z + ∂N₇∂η*∂η∂z + ∂N₇∂ζ*∂ζ∂z
    ∂𝝭∂z[8] = ∂N₈∂ξ*∂ξ∂z + ∂N₈∂η*∂η∂z + ∂N₈∂ζ*∂ζ∂z
end

function get∂𝝭∂ξ(::Element{:Hex8},ξ::Float64,η::Float64,ζ::Float64)
    ∂N₁∂ξ = - 0.125*(1.0-η)*(1.0-ζ)
    ∂N₂∂ξ =   0.125*(1.0-η)*(1.0-ζ)
    ∂N₃∂ξ =   0.125*(1.0+η)*(1.0-ζ)
    ∂N₄∂ξ = - 0.125*(1.0+η)*(1.0-ζ)
    ∂N₅∂ξ = - 0.125*(1.0-η)*(1.0+ζ)
    ∂N₆∂ξ =   0.125*(1.0-η)*(1.0+ζ)
    ∂N₇∂ξ =   0.125*(1.0+η)*(1.0+ζ)
    ∂N₈∂ξ = - 0.125*(1.0+η)*(1.0+ζ)
   
    return (∂N₁∂ξ,∂N₂∂ξ,∂N₃∂ξ,∂N₄∂ξ,∂N₅∂ξ,∂N₆∂ξ,∂N₇∂ξ,∂N₈∂ξ)
end

function get∂𝝭∂η(::Element{:Hex8},ξ::Float64,η::Float64,ζ::Float64)
    ∂N₁∂η = - 0.125*(1.0-ξ)*(1.0-ζ)
    ∂N₂∂η = - 0.125*(1.0+ξ)*(1.0-ζ)
    ∂N₃∂η =   0.125*(1.0+ξ)*(1.0-ζ)
    ∂N₄∂η =   0.125*(1.0-ξ)*(1.0-ζ)
    ∂N₅∂η = - 0.125*(1.0-ξ)*(1.0+ζ)
    ∂N₆∂η = - 0.125*(1.0+ξ)*(1.0+ζ)
    ∂N₇∂η =   0.125*(1.0+ξ)*(1.0+ζ)
    ∂N₈∂η =   0.125*(1.0-ξ)*(1.0+ζ)
    return (∂N₁∂η,∂N₂∂η,∂N₃∂η,∂N₄∂η,∂N₅∂η,∂N₆∂η,∂N₇∂η,∂N₈∂η)
end

function get∂𝝭∂ζ(::Element{:Hex8},ξ::Float64,η::Float64,ζ::Float64)
    ∂N₁∂ζ = - 0.125*(1.0-ξ)*(1.0-η)
    ∂N₂∂ζ = - 0.125*(1.0+ξ)*(1.0-η)
    ∂N₃∂ζ = - 0.125*(1.0+ξ)*(1.0+η)
    ∂N₄∂ζ = - 0.125*(1.0-ξ)*(1.0+η)
    ∂N₅∂ζ =   0.125*(1.0-ξ)*(1.0-η)
    ∂N₆∂ζ =   0.125*(1.0+ξ)*(1.0-η)
    ∂N₇∂ζ =   0.125*(1.0+ξ)*(1.0+η)
    ∂N₈∂ζ =   0.125*(1.0-ξ)*(1.0+η)
    

    return (∂N₁∂ζ,∂N₂∂ζ,∂N₃∂ζ,∂N₄∂ζ,∂N₅∂ζ,∂N₆∂ζ,∂N₇∂ζ,∂N₈∂ζ)
end
